# Часть первая : основы основ

## Как устроена программа I

> Задание: собрать по кусочкам программу, которая выводит на экран текст "Привет, мир!".

* `(`
* `print`
* `Hello, `
* `"`
* `)`
* `"`
* `world!`

## Как устроена программа II

> Задание: вставить в программу строки ниже в такой последовательности, чтобы программа выводила числа от 1 до 5 в порядке возрастания.

* `print(4)`
* `print(1)`
* `print(5)`
* `print(2)`
* `print(3)`

## Числа и строки I

> Задание: написать программу, которая складывает строки `"10"` и `"15"` и числа `10` и `15`, а затем выводит результат. Объяснить, почему результат именно такой.

Вывод программы, который должен получиться:
```
1015
25
```

## Числа и строки II

> [!IMPORTANT]
> `str()` превращает числа в строку. `int()` превращает строку в целые числа. `float()` превращает строку в дробные числа.

> Задание: написать программу, которая число 5 умножает на два, превращает в строку, снова умножает на два, превращает в целое число, и снова умножает на два.

Вывод программы, который должен получиться:
```
2020
```

## Числа и строки III

> [!IMPORTANT]
> `len()` подсчитывает количество символов у строки.

> Задание: написать программу, которая считает количество цифер в числе 5310.

Вывод программы, который должен получиться:
```
4
```

## Числа и строки IV

> Задание: для чисел 15 и 10, написать программу, которая по очереди ...
> * Складывает числа (`+`)
> * Вычитает числа (`-`)
> * Умножает числа (`*`)
> * Делит числа без дробной части (`//`)
> * Берет остаток от деления чисел (`%`)
> Затем, программа должна "склеить" все получившиеся числа в одно длинное число.

Вывод программы, который должен получиться:
```
25515015
```

# Часть вторая : переменные

## Переменные I 

> Задание: написать программу, которая сохраняет числа 15 и 10 в две переменные, затем складывает их, вычитает, умножает, делит без дробной части и берет остаток от деления, и выводит результат каждой операции на экран.

Вывод программы, который должен получиться:
```
25
5
150
1
5
```

## Переменные II

> Задание: написать программу, которая считывает пользовательский ввод, преобразовывает в число, затем записывает в переменную, а после этого выводит эту переменную, умноженную на три.

## Условные конструкции I

> [!IMPORTANT]
> Конструкция "если" выглядит следующим образом: сначала ключевое слово `if`, затем условие (например, неравенство), затем двоеточие `:`, и выполняемый код со следующей строки.

> [!WARNING]
> Соблюдать отступы после двоеточия обязательно, чтобы Python мог отличить, какой код относится к условию, а какой — нет.

> Задание: написать программу, которая считывает пользовательский ввод, преобразовывает в число, а затем выводит `Введенное число больше десяти!`, если число больше десяти, и `Введенное число меньше десяти!`, если число меньше десяти.

## Переменные III

> Задание: написать программу, которая считывает пользовательский ввод и записывает его в виде числа в переменную три раза. Затем, программа должна вывести наибольшее из трех введенных чисел.

## Условные конструкции II

> Задание: написать программу, которая считывает пользовательский ввод в виде числа, а затем выводит `Число четное!`, если введенное число делится на два без остатка, и `Число нечетное!`, если не делится.

## Переменные IV

> Задание: написать программу, которая считывает два введенных числа, например, числа 15 и 5, а затем выводит, например, `15 делится на 5 без остатка!`, если первое число делится на второе без остатка, или `15 не делится на 5!`, если не делится.

## Условные конструкции III

> [!IMPORTANT]
> После конструкции "если" можно дописать конструкцию "иначе-если" и "иначе". Они записываются так же, только вместо `if` используются слова `elif` и `else` соответственно.

> Задание: написать программу, которая считывает одно введенное число, а затем выводит `Число положительное!`, если число больше нуля, `Число отрицательное!`, если число меньше нуля, и `Число равно нулю!`, если число равно нулю. Обязательно использовать `elif` и `else`.

# Часть третья : циклы с условиями

## Цикл с условием I

> [!IMPORTANT]
> Один и тот же фрагмент кода можно заставить повторяться бесконечно: для этого, перед фрагментом стоит написать `while True:`, а фрагменту стоит добавить отступ.
>
> Программу, которая застряла на бесконечном цикле, можно остановить, нажав <kbd>Ctrl</kbd> + <kbd>C</kbd>.

> Задание: написать программу, которая выводит целые числа, начиная с нуля, последовательно увеличивающиеся на единицу.

Вывод программы, который должен получиться: (первые 10 строк)
```
0
1
2
3
4
5
6
7
8
9
```

## Цикл с условием II

> Задание: написать программу, которая считывает вводимое число, а затем выводит целые числа от нуля до введенного числа. 

## Цикл с условием III

> Задание: написать программу, которая создает переменную со строкой-паролем, а затем запрашивает пользовательский ввод до тех пор, пока пользователь не введет правильный пароль.